{
  "brain_tumor_glioma_1": "The image shows a left frontal lobe mass with irregular margins and surrounding edema, which is consistent with glioma presentation. The Grad-CAM highlighting concentrates on the left lateral ventricle region and adjacent white matter, corresponding to the tumor's location within the left frontal lobe where the AI model identified the pathological tissue.",
  "brain_tumor_glioma_2": "The original MRI shows a mass in the frontal lobe with associated mass effect and midline shift, which is characteristic of a glioma. The Grad-CAM highlighting shows intense red and yellow activation concentrated in the frontal and parietal lobes, with the strongest focus corresponding to the lateral cerebral hemispheres where the tumor burden is greatest.",
  "brain_tumor_meningioma_1": "There is a well-demarcated mass in the right frontal region that demonstrates homogeneous signal intensity consistent with meningioma. The Grad-CAM highlighting shows intense red and yellow activation concentrated in the right frontal lobe mass corresponding to the tumor location identified in the original MRI scan.",
  "brain_tumor_meningioma_2": "A well-demarcated mass is visible in the right frontal lobe with clear mass effect on the lateral ventricle. The Grad-CAM highlighting shows intense red and yellow activation concentrated on this right frontal mass and the compressed ventricular system, corresponding to the tumor and surrounding edema.",
  "brain_tumor_pituitary_1": "There is a focal lesion in the sella turcica at the midline base of the brain in the region of the pituitary gland, visible as a distinct mass on the original MRI scan. The Grad-CAM highlighting shows intense red and yellow activation concentrated on this sellar mass corresponding to the pituitary gland location at the base of the brain.",
  "brain_tumor_pituitary_2": "The original MRI demonstrates a focal mass centered within the sella turcica in the midline below the hypothalamus, which is the characteristic location of the pituitary gland. The Grad-CAM heat map shows intense red and yellow activation directly overlying the sellar region in both hemispheres, corresponding precisely to the pituitary gland and confirming the AI model's focus on this central endocrine structure.",
  "brain_tumor_notumor_1": "The bilateral cerebral ventricles and periventricular white matter demonstrate normal size and signal intensity without evidence of mass effect or abnormal enhancement. The Grad-CAM highlighting concentrates on the frontal and parietal lobes with peak activation in the periventricular white matter regions bilaterally, corresponding to the normal brain parenchyma being analyzed for classification purposes.",
  "brain_tumor_notumor_2": "The original MRI shows normal brain parenchyma with preserved gray-white matter differentiation and no focal masses or abnormal signal intensity in the supratentorial compartment. The Grad-CAM highlighting concentrates in the frontal and parietal lobes with peak activation in the gray matter of the precentral and postcentral gyri, corresponding to the motor and sensory cortices.",
  "pneumonia_normal_1": "The bilateral lungs demonstrate normal pulmonary vasculature and clear lung fields without evidence of infiltrates, consolidation, or abnormal opacities throughout both hemithoraces. The Grad-CAM highlighting concentrates in the central mediastinal region and bilateral hilar areas, corresponding to the normal cardiac silhouette and central pulmonary vasculature structures.",
  "pneumonia_normal_2": "The bilateral lung fields demonstrate clear parenchyma without consolidation, infiltrates, or focal opacities, with normal hilar contours and mediastinal silhouette supporting the normal diagnosis. The Grad-CAM highlighting is concentrated in the central mediastinal region and bilateral lung hila, corresponding to the heart and proximal pulmonary vessels which are normal anatomical structures the model used to confirm the absence of pathology.",
  "pneumonia_pneumonia_1": "The bilateral lower lobe infiltrates with consolidation visible in the original radiograph, particularly prominent in the left lower lobe, demonstrate the classic presentation of pneumonia. The Grad-CAM highlighting concentrates in the bilateral lower lung fields with maximum intensity over the left lower lobe consolidation, corresponding to the areas of alveolar opacification that the model identified as pathologic.",
  "pneumonia_pneumonia_2": "The original X-ray demonstrates consolidation in the bilateral lower lobes with increased opacification in the lung bases consistent with pneumonia. The Grad-CAM highlighting shows intense red and yellow activation concentrated in the lower lung zones bilaterally, corresponding to the consolidated basilar lung tissue where the pneumonic infiltrates are located.",
  "retinal_oct_cnv_1": "The bright hyperreflective material with irregular elevation located in the subretinal space beneath the fovea indicates choroidal neovascularization with associated exudation. The Grad-CAM highlighting concentrates on the two distinct hyperreflective foci in the subfoveal and parafoveal regions, which correspond to the neovascular complex and its associated fluid accumulation.",
  "retinal_oct_cnv_2": "The original OCT scan demonstrates a well-defined hyperreflective lesion at the level of the retinal pigment epithelium and Bruch's membrane in the subfoveal region with associated disruption of the normal retinal architecture. The Grad-CAM heatmap shows intense red and yellow highlighting concentrated at this same subfoveal lesion corresponding to the neovascular membrane complex and its associated exudative changes.",
  "retinal_oct_dme_1": "The original OCT scan demonstrates intraretinal fluid accumulation in the macula with disruption of the normal foveal contour, characteristic of diabetic macular edema. The Grad-CAM highlighting shows intense red and yellow activation concentrated at the foveal center and extending into the inner retinal layers where the fluid collection is most prominent.",
  "retinal_oct_dme_2": "The original scan demonstrates significant thickening and disruption of the central foveal contour with intraretinal fluid accumulation in the foveal pit, which is the hallmark structural finding of diabetic macular edema. The Grad-CAM highlighting with red and yellow coloration is concentrated in the central foveal region corresponding to the thickened neurosensory retina where the fluid accumulation and edema are located.",
  "retinal_oct_drusen_1": "The original scan demonstrates multiple small yellowish depositions in the subretinal space beneath the retinal pigment epithelium in the macula, which are characteristic of drusen.\n\nThe Grad-CAM highlighting concentrates in the red and yellow zones directly over the retinal pigment epithelium and subfoveal region, corresponding exactly to where the drusenoid deposits are located in the original grayscale image.",
  "retinal_oct_drusen_2": "The hyper-reflective deposits visible at the level of the retinal pigment epithelium and Bruch's membrane in the subfoveal region represent drusen consistent with age-related macular degeneration. The Grad-CAM highlighting in red and yellow is concentrated at the inner retinal layers directly overlying the drusen deposits, indicating the AI model focused on the structural changes at the RPE-Bruch's membrane complex.",
  "retinal_oct_normal_1": "The foveal pit is preserved with normal contour and the retinal pigment epithelium layer demonstrates regular architecture without elevation or disruption in the central macula. The Grad-CAM highlighting concentrates in red and yellow tones directly over the foveal pit and inner retinal layers, indicating the model focused on the normal foveal depression and surrounding retinal anatomy as key diagnostic features.",
  "retinal_oct_normal_2": "The retinal layers demonstrate normal foveal anatomy with preserved photoreceptor ellipsoid zone and intact retinal pigment epithelium at the foveola. The Grad-CAM highlighting concentrates on the foveal pit region in the center of the macula, corresponding to the normal foveal depression and inner retinal morphology that characterizes healthy central vision.",
  "bone_fracture_fractured_1": "The fracture line is visible in the distal tibia with associated disruption of the cortical bone continuity at the ankle joint level. The Grad-CAM highlighting shows intense red and yellow activation concentrated over the distal tibial metaphysis and medial malleolus, which corresponds to the primary fracture site that the model identified as the key diagnostic feature.",
  "bone_fracture_fractured_2": "The fracture line is located through the distal radius with clear disruption of the cortical bone and displacement visible in the midline of the forearm bones. The Grad-CAM highlighting with red and yellow coloration is concentrated on the distal radius in the region of the fracture site, corresponding to the area of maximum bone disruption and cortical discontinuity.",
  "bone_fracture_fractured_3": "The original X-ray demonstrates a fracture line through the distal radius with angulation and displacement of the fracture fragments. The Grad-CAM highlighting concentrates intensely on the distal radial metaphysis and the fracture site, corresponding to the area of maximum bone disruption and cortical discontinuity.",
  "bone_fracture_fractured_4": "The fracture is located at the distal tibia with a clear linear break visible in the bone cortex near the ankle joint. The Grad-CAM highlighting concentrates on the distal tibial region where the fracture line is present, corresponding to the area of bone disruption that the model identified as the primary diagnostic feature.",
  "bone_fracture_normal_1": "The distal tibia and fibula demonstrate intact cortical margins with continuous bone density throughout the metaphyseal and diaphyseal regions without any linear lucencies or step-offs. The Grad-CAM highlighting concentrates intensely on the distal tibial plafond and medial malleolus, which represents the primary region of diagnostic focus for the fracture classification algorithm.",
  "bone_fracture_normal_2": "The calcaneus demonstrates intact cortical margins with continuous trabecular architecture throughout the body and tuberosity, supporting the non-fractured classification. The Grad-CAM highlighting concentrates on the plantar aspect and central body of the calcaneus, corresponding to the weight-bearing region where fractures most commonly occur.",
  "bone_fracture_normal_3": "The cortical continuity of the distal tibia and fibula is maintained throughout the visualized bone length with no disruption in the bone density or alignment visible on the original radiograph. The Grad-CAM highlighting concentrates in the distal tibiofibular region where the AI model focused its analysis to confirm the absence of fracture lines in this anatomically complex area.",
  "bone_fracture_normal_4": "The distal radius and ulna demonstrate intact cortical outlines with continuous bone density throughout the metaphyseal and diaphyseal regions, with no visible lucency or disruption indicating fracture. The Grad-CAM highlighting is concentrated over the distal carpal bones and the radiocarpal joint space, corresponding to the area of maximum density change and anatomical complexity at the wrist articulation."
}